test-plan/practice-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Inviz URL">
        <intProp name="ThreadGroup.num_threads">1000</intProp>
        <intProp name="ThreadGroup.ramp_time">200</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">https://inviztv.servv.app/api/v1/shopify/library/48?shop=dfbmvod.myshopify.com&amp;logged_in_customer_id=8124341092427&amp;path_prefix=/apps/library&amp;timestamp=1745504835&amp;signature=5050e80678cf2d263729c247e3ca84a396d4d0b278d79d0bc3a86450c913f6c8</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="Bitmovin URL Extractor">
          <stringProp name="JSONPostProcessor.referenceNames">bitmoving_urls</stringProp>
          <stringProp name="JSONPostProcessor.jsonPathExprs">$.bitmovin_hls_url</stringProp>
          <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
        </JSONPostProcessor>
        <hashTree/>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <com.blazemeter.jmeter.hls.logic.HlsSampler guiclass="com.blazemeter.jmeter.hls.gui.HlsSamplerGui" testclass="com.blazemeter.jmeter.hls.logic.HlsSampler" testname="bzm - Streaming Sampler">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HLS.URL_DATA">https://d2u99wf7mdo7vs.cloudfront.net/4/2025-04/outputs/48/stream.m3u8?Expires=1746021253&amp;Signature=W63dfwtgOJHGXZDQmYXTN7UpQDPZXPSYwC7~oeG-Trb7H3oxVFXGJc-2uReW1gh-2UqwHHjYz6V4z1AL9WTz~148Y9jeQdLLLsluwucAKNI5w6Y6LHxlOIzwpf3t4SpNP3nA~JWxyGl2RG7siQT~kCUCICdfo-p~~m02rFFF9mQ1TujcYt-mYSj1XFqQJPFzXAWLBU1tfhR99pNig5Mx7FWtBhhyj9AdrmYDkU-XrSssu32fM7BYGdzOFq11h-3q6jGQzAFex7ymIxA4ZuWnT3psI6mTbea-jpWS6ZkzagCZPFSTachUCRRKGTp5E37jzXalU~Zr2X2kjBzKDQiceg__&amp;Key-Pair-Id=K356VZXVH1ZI2P </stringProp>
          <boolProp name="HLS.DURATION">false</boolProp>
          <stringProp name="HLS.BANDWIDTH_TYPE">minBandwidth</stringProp>
          <stringProp name="HLS.RESOLUTION_TYPE">minResolution</stringProp>
          <boolProp name="HLS.RESUME_DOWNLOAD">false</boolProp>
          <stringProp name="VIDEO_STREAMING.PROTOCOL">HLS</stringProp>
        </com.blazemeter.jmeter.hls.logic.HlsSampler>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>